#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> japaneseMaleFirstNames{
    "正一", "正二", "正三", "清",   "辰雄", "三郎", "昭二", "昭三", "茂",   "勇",   "明",   "弘",   "勝",   "稔",
    "博",   "隆",   "誠",   "浩",   "健一", "大輔", "達也", "翔太", "拓也", "健太", "大輝", "翔",   "駿",   "蓮",
    "大翔", "陸",   "悠真", "蒼",   "昭",   "実",   "進",   "和夫", "修",   "浩一", "哲也", "剛",   "大介", "海斗",
    "拓海", "颯太", "悠斗", "陽翔", "湊",   "新",   "樹",   "正雄", "勝利", "豊",   "和彦", "学",   "直樹", "健太郎",
    "大和", "陽向", "瑛太", "陽太", "正",   "一郎", "勲",   "徹",   "浩二", "亮",   "大樹", "翼",   "義雄", "昭一",
    "功",   "武",   "淳",   "和也", "大地", "匠",   "悠人", "朝陽", "律",   "武雄", "英樹", "秀樹", "祐介", "雄太",
    "翔平", "大貴", "太陽", "颯",   "陽斗", "颯真", "蒼空", "優斗", "正治", "昇",   "竜也", "聡",   "貴大", "直人",
    "輝",   "優太", "悠太", "陸斗", "太一", "悠",   "浩之", "健",   "博之", "亮太", "一輝", "空",   "陽大", "正夫",
    "秀雄", "幸雄", "勉",   "崇",   "洋平", "拓哉", "涼太", "大雅", "海翔", "龍生", "結翔", "悠翔", "葵",   "正男",
    "辰男", "一男", "優",   "雄大", "康平", "智也", "竜",   "悠希", "歩夢",
};
const std::vector<std::string> japaneseFemaleFirstNames{
    "千代子", "静子", "文子",   "キヨ",   "千代",   "ハル",   "キミ",   "久子", "ヨシ",   "清子", "正子",   "貞子",
    "八重子", "きよ", "フミ",   "ハナ",   "和子",   "愛子",   "きみ",   "トミ", "はる",   "マサ", "美代子", "光子",
    "幸子",   "照子", "芳子",   "節子",   "昭子",   "信子",   "敏子",   "典子", "君子",   "弘子", "洋子",   "美智子",
    "京子",   "悦子", "栄子",   "孝子",   "良子",   "恵子",   "勝子",   "紀子", "恵美子", "啓子", "久美子", "由美子",
    "裕子",   "順子", "智子",   "明美",   "愛",     "恵",     "麻衣",   "麻美", "香織",   "美穂", "彩",     "沙織",
    "愛美",   "絵美", "舞",     "恵美",   "陽子",   "成美",   "あゆみ", "美香", "理恵",   "友美", "智美",   "明日香",
    "由佳",   "瞳",   "麻衣子", "彩香",   "真由美", "純子",   "直美",   "優子", "裕美",   "由美", "直子",   "めぐみ",
    "美紀",   "浩子", "ゆかり", "さくら", "美咲",   "陽菜",   "葵",     "七海", "美羽",   "結衣", "美月",   "凛",
    "美優",   "未来", "優奈",   "萌",     "優花",   "美桜",   "莉子",   "菜月", "結愛",   "結菜", "花音",   "心優",
    "真央",   "玲奈", "ひなた", "彩乃",   "彩花",   "優衣",   "琴音",   "百花", "遥",     "里奈", "茜",     "千尋",
    "楓",     "亜美", "佳奈",   "真由",   "桃子",   "菜々子", "千夏",   "菜摘", "奈々",   "早紀", "杏",     "陽葵",
    "芽依",   "結月", "咲良",   "凜",     "紬",     "心愛",   "花",     "心春", "愛莉",   "愛菜", "桜",     "心結",
    "美結",
};
}
