#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> chineseMalesFirstNames = {
    "建华", "建国", "建军", "国强", "国平", "国良", "国栋", "国辉", "志国", "志明", "勇",   "军",   "伟",
    "强",   "刚",   "涛",   "斌",   "波",   "辉",   "磊",   "超",   "鹏",   "杰",   "浩",   "鑫",   "帅",
    "宇",   "晨",   "诚",   "成",   "民",   "明",   "阳",   "瑜",   "熙成", "熙瑶", "家豪", "家明", "俊杰",
    "俊熙", "沐宸", "浩宇", "浩然", "浩轩", "浩晨", "沐辰", "茗泽", "奕辰", "奕泽", "宇泽", "宇轩", "宇航",
    "沐阳", "梓诚", "梓豪", "梓睿", "梓浩", "浩辰", "癸霖", "一全", "三锋", "义轩", "俊凯", "子豪", "振东",
    "智杰", "哲新", "文昊", "中海", "超栋", "治涛", "治文", "文韬", "敬彪", "敬阳", "政君", "立伟", "呈轩",
};

const std::vector<std::string> chineseFemalesFirstNames = {
    "秀英", "秀兰", "秀珍", "桂英", "桂兰", "玉兰", "玉珍", "玉英", "玉梅", "凤英", "兰英", "婷婷", "国英",
    "国珍", "国华", "国芳", "国兰", "国秀", "国琴", "国荣", "国香", "英",   "萍",   "蒙",   "红",   "丽",
    "敏",   "芳",   "静",   "霞",   "燕",   "娟",   "艳",   "娜",   "丹",   "玲",   "婷",   "珈",   "雪",
    "倩",   "悦",   "颖",   "洁",   "慧",   "开慧", "丽芬", "丽芳", "丽萍", "若汐", "一诺", "艺涵", "依诺",
    "梓涵", "梓晨", "梓馨", "梓萱", "梓妍", "梓玥", "苡沫", "雨桐", "欣怡", "语桐", "语汐", "雨涵", "雨欣",
    "诗雨", "婷方", "美方", "雅婷", "紫林", "天娇", "万佳", "子欣", "海燕", "乙萍", "安琪", "馨羽", "馥君",
    "思佳", "雅鑫", "静怡", "晨阳", "佳琪", "雯静", "榕融",
};
}
