#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> kazakhMalesFirstNames = {
    "Абай",        "Абдолла",    "Абдулла",    "Абдуллаһ",  "Абдінасір",  "Абылай",    "Азамат",      "Азиз",
    "Айбек",       "Айберген",   "Айболат",    "Айдос",     "Айнабек",    "Айсұлтан",  "Айтқали",     "Ақжан",
    "Ақжол",       "Аққу",       "Алдаберген", "Алдияр",    "Алпан",      "Алпысбай",  "Алтай",       "Алтынбай",
    "Алтынбек",    "Амангелді",  "Амандос",    "Аманжол",   "Амантай",    "Аңсар",     "Арыстан",     "Арыстанбек",
    "Асанбай",     "Асанғали",   "Асқар",      "Асылбек",   "Ахмет",      "Аюхан",     "Әбдуәли",     "Әбдіғазиз",
    "Әбдіғани",    "Әбдіғаппар", "Әбдіжаппар", "Әбдіжәміл", "Әбдіқадыр",  "Әбділда",   "Әбділхамит",  "Әбдімәлік",
    "Әбдіразақ",   "Әбдірахман", "Әбдірәсіл",  "Әбдішүкір", "Әбиірбек",   "Әбубәкір",  "Әбуғали",     "Әбілғазы",
    "Әбілқайыр",   "Әділ",       "Әділбек",    "Әділхан",   "Әкежан",     "Әлжан",     "Әлжаппар",    "Әли",
    "Әлімжан",     "Әлімқұл",    "Әліхан",     "Әмірбек",   "Әнес",       "Әсет",      "Әубәкір",     "Әуелхан",
    "Бағдат",      "Базарбай",   "Байысхан",   "Бақтияр",   "Бақытжан",   "Балтабек",  "Бауыржан",    "Бәкір",
    "Бейбіт",      "Бейсен",     "Бекболат",   "Бекзат",    "Бердібек",   "Бердіқұл",  "Болат",       "Боранбай",
    "Бөріхан",     "Бүркітбай",  "Біржан",     "Ғабдулла",  "Ғабдұлла",   "Ғабит",     "Ғазиз",       "Ғазизхан",
    "Ғалымжан",    "Ғани",       "Ғаппар",     "Ғұсман",    "Дамир",      "Даниял",    "Дастан",      "Дәлелхан",
    "Дәнеш",       "Дәулет",     "Дәуіт",      "Дос",       "Досай",      "Дүйсен",    "Дүйсенғазы",  "Дінмұхамед",
    "Дінмұхаммед", "Еділ",       "Елнұр",      "Ербол",     "Ерболат",    "Ербосын",   "Ережеп",      "Ерекен",
    "Еркебұлан",   "Еркін",      "Ерлан",      "Ермек",     "Ермұхамет",  "Ерік",      "Есбосын",     "Есенгелді",
    "Ескендір",    "Жабайхан",   "Жақия",      "Жақсыбек",  "Жақып",      "Жақыпбек",  "Жамалбек",    "Жанбек",
    "Жанболат",    "Жандос",     "Жанқуат",    "Жанпейіс",  "Жаңабай",    "Жаңабек",   "Жарасбай",    "Жарасқан",
    "Жармұқамет",  "Жармұхамед", "Жармұхамет", "Жауынбай",  "Жеменей",    "Жеңіс",     "Жолбарыс",    "Жолжақсы",
    "Жомарт",      "Жомартбай",  "Жұмабай",    "Жұмағали",  "Жұмақан",    "Жұмамұрат", "Жұманазар",   "Жұмекен",
    "Жүніс",       "Жүсіп",      "Жүсіпбек",   "Жылқыбек",  "Зәкария",    "Зәкәрия",   "Зұлпықар",    "Ибрахим",
    "Ибраһим",     "Иса",        "Ислам",      "Исламбек",  "Исхақ",      "Кәрім",     "Кенжеғұл",    "Кеңгірбай",
    "Керімбай",    "Күнесхан",   "Қабдолла",   "Қабдула",   "Қабдыкәрім", "Қабыл",     "Қажымқан",    "Қайролла",
    "Қалихан",     "Қалқаман",   "Қанат",      "Қаныш",     "Қаржаубай",  "Қасым",     "Қасымбек",    "Қатшыбек",
    "Қияқбай",     "Қойшыбек",   "Қуан",       "Қуаныш",    "Қуат",       "Құбыш",     "Құдайберген", "Құдыс"};

const std::vector<std::string> kazakhFemalesFirstNames = {
    "Ағила",   "Ажар",    "Ажаргүл",  "Аида",      "Айгүл",     "Айдай",     "Айжан",    "Айжүрек",  "Айнұр",
    "Айша",    "Ақбота",  "Ақгүл",    "Ақерке",    "Ақжан",     "Ақкүміс",   "Аққу",     "Алмагүл",  "Алтынай",
    "Анаргүл", "Ардақ",   "Аруай",    "Аружан",    "Аяжан",     "Аяужан",    "Әдила",    "Әдина",    "Әлима",
    "Әлия",    "Әсел",    "Әсемай",   "Әсемгүл",   "Базаргүл",  "Бақаргүл",  "Батима",   "Бибігүл",  "Ботакөз",
    "Гауһар",  "Гүлажар", "Гүлай",    "Гүлбақыт",  "Гүлбаршын", "Гүлболсын", "Гүлдана",  "Гүлжан",   "Гүлжауһар",
    "Гүлмира", "Гүлнар",  "Гүлнұр",   "Гүлпариза", "Гүлфайрус", "Гүлфариза", "Гүлшара",  "Гүлшат",   "Ғайни",
    "Ғалия",   "Дариға",  "Дәлила",   "Дина",      "Динара",    "Ділдә",     "Елерке",   "Жазира",   "Жамал",
    "Жанар",   "Жаннұр",  "Жансая",   "Жәмила",    "Жолжақсы",  "Жұлдыз",    "Жібек",    "Зейнекүл", "Зияда",
    "Зылиха",  "Күнсұлу", "Қадиша",   "Қанағат",   "Қарақат",   "Қасиет",    "Ләззат",   "Ләтипа",   "Лейла",
    "Мақпал",  "Марияш",  "Мәриям",   "Нәзерке",   "Нұрбақыт",  "Нұрзада",   "Нұрсауле", "Нұрсұлу",  "Перизат",
    "Райана",  "Райхан",  "Раяна",    "Рәбиға",    "Риза",      "Роза",      "Сабина",   "Сайрагүл", "Салтанат",
    "Самал",   "Сара",    "Сәнімгүл", "Сәуле",     "Таңшолпан", "Ұлбала",    "Ұлбике",   "Ұлболсын", "Ұлдана",
    "Ұлжан",   "Ұлмекен", "Фатима",   "Хадиша",    "Халида",    "Шарапат",   "Шахзада",  "Шаһизада", "Шәмшия",
    "Шәрбану", "Шолпан",  "Ырысты",   "Іңкәр"};
}