#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> kazakhMalesLastNames = {
    "Асылмұратов", "Әбдірахманов", "Әлімқұлов",  "Етекбаев", "Жүнісов",    "Жүсіп",    "Иманқұлов",
    "Исламқұлов",  "Қуатбаев",     "Құлов",      "Мәженов",  "Назарбаев",  "Рүстемов", "Сәтбаев",
    "Сұлтанбеков", "Сүгірбаев",    "Сүлейменов", "Тоқаев",   "Торайғыров", "Тұяқбаев", "Ысмайылов"};

const std::vector<std::string> kazakhFemalesLastNames = {
    "Әбдірахманова", "Әлімқұлова",  "Етекбаева", "Жүнісова",   "Иманқұлова", "Исламқұлова",
    "Қуатбаева",     "Құлова",      "Мәженова",  "Назарбаева", "Рүстемова",  "Сұлтанбекова",
    "Сүгірбаева",    "Сүлейменова", "Тоқаева",   "Тұяқбаева",  "Ысмайылова", "Асылмұратова"};
}