#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> kazakhMalesFirstNames = {};

const std::vector<std::string> kazakhFemalesFirstNames = {
    "Ағила",   "Ажар",    "Ажаргүл",  "Аида",      "Айгүл",     "Айдай",     "Айжан",    "Айжүрек",  "Айнұр",
    "Айша",    "Ақбота",  "Ақгүл",    "Ақерке",    "Ақжан",     "Ақкүміс",   "Аққу",     "Алмагүл",  "Алтынай",
    "Анаргүл", "Ардақ",   "Аруай",    "Аружан",    "Аяжан",     "Аяужан",    "Әдила",    "Әдина",    "Әлима",
    "Әлия",    "Әсел",    "Әсемай",   "Әсемгүл",   "Базаргүл",  "Бақаргүл",  "Батима",   "Бибігүл",  "Ботакөз",
    "Гауһар",  "Гүлажар", "Гүлай",    "Гүлбақыт",  "Гүлбаршын", "Гүлболсын", "Гүлдана",  "Гүлжан",   "Гүлжауһар",
    "Гүлмира", "Гүлнар",  "Гүлнұр",   "Гүлпариза", "Гүлфайрус", "Гүлфариза", "Гүлшара",  "Гүлшат",   "Ғайни",
    "Ғалия",   "Дариға",  "Дәлила",   "Дина",      "Динара",    "Ділдә",     "Елерке",   "Жазира",   "Жамал",
    "Жанар",   "Жаннұр",  "Жансая",   "Жәмила",    "Жолжақсы",  "Жұлдыз",    "Жібек",    "Зейнекүл", "Зияда",
    "Зылиха",  "Күнсұлу", "Қадиша",   "Қанағат",   "Қарақат",   "Қасиет",    "Ләззат",   "Ләтипа",   "Лейла",
    "Мақпал",  "Марияш",  "Мәриям",   "Нәзерке",   "Нұрбақыт",  "Нұрзада",   "Нұрсауле", "Нұрсұлу",  "Перизат",
    "Райана",  "Райхан",  "Раяна",    "Рәбиға",    "Риза",      "Роза",      "Сабина",   "Сайрагүл", "Салтанат",
    "Самал",   "Сара",    "Сәнімгүл", "Сәуле",     "Таңшолпан", "Ұлбала",    "Ұлбике",   "Ұлболсын", "Ұлдана",
    "Ұлжан",   "Ұлмекен", "Фатима",   "Хадиша",    "Халида",    "Шарапат",   "Шахзада",  "Шаһизада", "Шәмшия",
    "Шәрбану", "Шолпан",  "Ырысты",   "Іңкәр"};
}