#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> ukrainianMalesFirstNames = {
    "Августин",  "Аврелій",     "Адам",       "Адріян",    "Азарій",    "Алевтин",  "Альберт",   "Анастас",
    "Анастасій", "Анатолій",    "Андрій",     "Антін",     "Антон",     "Антоній",  "Аркадій",   "Арсен",
    "Арсеній",   "Артем",       "Архип",      "Аскольд",   "Афанасій",  "Біломир",  "Білослав",  "Богдан",
    "Божемир",   "Божен",       "Болеслав",   "Боримир",   "Боримисл",  "Борис",    "Борислав",  "Братимир",
    "Братислав", "Братомил",    "Братослав",  "Брячислав", "Будимир",   "Буйтур",   "Буревіст",  "В’ячеслав",
    "Вадим",     "Валентин",    "Валерій",    "Василь",    "Велемир",   "Віктор",   "Віталій",   "Влад",
    "Владислав", "Володимир",   "Володислав", "Всевлад",   "Всеволод",  "Всеслав",  "Гаврило",   "Гарнослав",
    "Геннадій",  "Георгій",     "Герасим",    "Гліб",      "Гнат",      "Гордій",   "Горимир",   "Горислав",
    "Градимир",  "Григорій",    "Далемир",    "Данило",    "Дарій",     "Даромир",  "Денис",     "Дмитро",
    "Добромир",  "Добромисл",   "Доброслав",  "Євген",     "Єремій",    "Захар",    "Захарій",   "Зборислав",
    "Звенигор",  "Звенимир",    "Звенислав",  "Земислав",  "Зеновій",   "Зиновій",  "Злат",      "Златомир",
    "Зоремир",   "Зореслав",    "Зорян",      "Іван",      "Ігор",      "Ізяслав",  "Ілля",      "Кий",
    "Корнелій",  "Корнилій",    "Корнило",    "Корній",    "Костянтин", "Кузьма",   "Лаврентій", "Лаврін",
    "Лад",       "Ладислав",    "Ладо",       "Ладомир",   "Левко",     "Листвич",  "Лук’ян",    "Любодар",
    "Любозар",   "Любомир",     "Макар",      "Максим",    "Мар’ян",    "Маркіян",  "Марко",     "Матвій",
    "Мечислав",  "Микита",      "Микола",     "Мирон",     "Мирослав",  "Михайло",  "Мстислав",  "Мусій",
    "Назар",     "Назарій",     "Натан",      "Немир",     "Нестор",    "Олег",     "Олександр", "Олексій",
    "Олелько",   "Олесь",       "Омелян",     "Орест",     "Орхип",     "Остап",    "Охрім",     "Павло",
    "Панас",     "Пантелеймон", "Петро",      "Пилип",     "Подолян",   "Потап",    "Радим",     "Радимир",
    "Ратибор",   "Ратимир",     "Родіон",     "Родослав",  "Роксолан",  "Роман",    "Ростислав", "Руслан",
    "Святополк", "Святослав",   "Семибор",    "Сергій",    "Синьоок",   "Славолюб", "Славомир",  "Славута",
    "Сніжан",    "Сологуб",     "Станіслав",  "Степан",    "Стефаній",  "Стожар",   "Тарас",     "Тиміш",
    "Тимофій",   "Тихон",       "Тур",        "Устим",     "Хвалимир",  "Хорив",    "Чорнота",   "Щастислав",
    "Щек",       "Юліан",       "Юрій",       "Юхим",      "Ян",        "Ярема",    "Яровид",    "Яромил",
    "Яромир",    "Ярополк",     "Ярослав"};

const std::vector<std::string> ukrainianFemalesFirstNames = {
    "Аврелія",    "Аврора",     "Агапія",     "Агата",       "Агафія",     "Агнеса",   "Агнія",     "Агрипина",
    "Ада",        "Аделаїда",   "Аделіна",    "Адріана",     "Азалія",     "Алевтина", "Аліна",     "Алла",
    "Альбіна",    "Альвіна",    "Анастасія",  "Анатолія",    "Ангеліна",   "Анжела",   "Анна",      "Антонида",
    "Антоніна",   "Антонія",    "Анфіса",     "Аполлінарія", "Аполлонія",  "Аркадія",  "Артемія",   "Афанасія",
    "Білослава",  "Біляна",     "Благовіста", "Богдана",     "Богуслава",  "Божена",   "Болеслава", "Борислава",
    "Броніслава", "В’ячеслава", "Валентина",  "Валерія",     "Варвара",    "Василина", "Вікторія",  "Вілена",
    "Віленіна",   "Віліна",     "Віола",      "Віолетта",    "Віра",       "Віргінія", "Віта",      "Віталіна",
    "Влада",      "Владислава", "Власта",     "Всеслава",    "Галина",     "Ганна",    "Гелена",    "Далеслава",
    "Дана",       "Дарина",     "Дарислава",  "Діана",       "Діяна",      "Добринка", "Добромила", "Добромира",
    "Добромисла", "Доброслава", "Долеслава",  "Доляна",      "Жанна",      "Жозефіна", "Забава",    "Звенислава",
    "Зінаїда",    "Злата",      "Зореслава",  "Зорина",      "Зоряна",     "Зоя",      "Іванна",    "Ілона",
    "Інна",       "Іннеса",     "Ірина",      "Ірма",        "Калина",     "Каріна",   "Катерина",  "Квітка",
    "Квітослава", "Клавдія",    "Крентта",    "Ксенія",      "Купава",     "Лада",     "Лариса",    "Леся",
    "Ликера",     "Лідія",      "Лілія",      "Любава",      "Любислава",  "Любов",    "Любомила",  "Любомира",
    "Люборада",   "Любослава",  "Людмила",    "Людомила",    "Майя",       "Мальва",   "Мар’яна",   "Марина",
    "Марічка",    "Марія",      "Марта",      "Меланія",     "Мечислава",  "Милодара", "Милослава", "Мирослава",
    "Мілана",     "Мокрина",    "Мотря",      "Мстислава",   "Надія",      "Наталія",  "Неля",      "Немира",
    "Ніна",       "Огняна",     "Оксана",     "Олександра",  "Олена",      "Олеся",    "Ольга",     "Ореста",
    "Орина",      "Орислава",   "Орися",      "Оріяна",      "Павліна",    "Палажка",  "Пелагея",   "Пелагія",
    "Поліна",     "Поляна",     "Потішана",   "Радміла",     "Радослава",  "Раїна",    "Раїса",     "Роксолана",
    "Ромена",     "Ростислава", "Руслана",    "Світлана",    "Святослава", "Слава",    "Сміяна",    "Сніжана",
    "Соломія",    "Соня",       "Софія",      "Станислава",  "Сюзана",     "Таїсія",   "Тамара",    "Тетяна",
    "Устина",     "Фаїна",      "Февронія",   "Федора",      "Феодосія",   "Харитина", "Христина",  "Христя",
    "Юліанна",    "Юлія",       "Юстина",     "Юхима",       "Юхимія",     "Яна",      "Ярина",     "Ярослава"};
}
