#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> israelisMalesFirstNames = {
    "דוד",    "לביא",   "אריאל",   "יוסף",    "נועם",   "אורי",   "רפאל",  "ארי",    "משה",    "יהודה",
    "אברהם",  "איתן",   "דניאל",   "ישראל",   "איתי",   "שמואל",  "אליה",  "יהונתן", "יצחק",   "שמעון",
    "יעקב",   "מיכאל",  "עומר",    "יונתן",   "אהרון",  "חיים",   "אימרי", "אדם",    "שלמה",   "איתמר",
    "עידו",   "יאיר",   "ינאי",    "מאיר",    "ישי",    "מרדכי",  "הראל",  "בניה",   "ניתאי",  "בנימין",
    "אליהו",  "מנחם",   "ליאם",    "בארי",    "אלון",   "עילאי",  "עמית",  "בן",     "נתן",    "אור",
    "נתנאל",  "ריף",    "אביב",    "גיא",     "נהוראי", "מאור",   "ריי",   "רום",    "ליאו",   "נוה",
    "יובל",   "הלל",    "עומרי",   "שחר",     "אלרואי", "רוי",    "נריה",  "נדב",    "דור",    "צבי",
    "מלאכי",  "רועי",   "עידן",    "ראם",     "אביתר",  "נבו",    "תום",   "אלחנן",  "אוריאל", "מעיין",
    "אריה",   "שלום",   "גבריאל",  "אליאב",   "עוז",    "אליעזר", "שילה",  "ארבל",   "ירדן",   "לני",
    "יואב",   "נחמן",   "גפן",     "ליאור",   "יהושע",  "אביאל",  "דן",    "לוי",    "אמיתי",  "יהב",
    "עמנואל", "זיו",    "אייל",    "אלעזר",   "מתן",    "ידידיה", "פנחס",  "יהלי",   "אופק",   "אופיר",
    "אבישי",  "בר",     "דביר",    "יחיאל",   "עברי",   "אוריה",  "שקד",   "לירוי",  "שי",     "רני",
    "ים",     "נפתלי",  "יגל",     "פלג",     "אסף",    "ינון",   "אדיר",  "רון",    "שליו",   "אושר",
    "כפיר",   "אשר",    "ברוך",    "רותם",    "שניאור", "אפרים",  "גל",    "דין",    "טום",    "רואי",
    "תומר",   "אוראל",  "נטע",     "אלמוג",   "עתי",    "ראובן",  "יותם",  "שמחה",   "זוהר",   "טומי",
    "שון",    "רז",     "עופרי",   "יחזקאל",  "יהל",    "ירין",   "יואל",  "צור",    "סהר",    "ליאב",
    "דב",     "עקיבא",  "טל",      "זאב",     "גלעד",   "ברי",    "גבע",   "איליי",  "אלישע",  "הדר",
    "אילון",  "ניב",    "אדר",     "קורן",    "עילי",   "ליעד",   "הילל",  "אליאור", "אחיה",   "סיני",
    "אושרי",  "קאי",    "אמרי",    "אלימלך",  "בועז",   "יוחנן",  "כרמל",  "אלרועי", "יאן",    "שאול",
    "אסיף",   "שלו",    "ליאל",    "ברק",     "עדן",    "ארז",    "עדיאל", "דרור",   "ניל",    "ישעיה",
    "עופר",   "יפתח",   "נחום",    "אראל",    "כרמי",   "טוהר",   "פאר",   "מרום",   "דורי",   "ארד",
    "לאו",    "רעי",    "אלעד",    "עמיחי",   "מאורי",  "נגב",    "גור",   "אביחי",  "ליאון",  "עובדיה",
    "עדי",    "אורן",   "ריו",     "און",     "שוהם",   "אלרוי",  "טוביה", "בניהו",  "עזרא",   "גיל",
    "אלאור",  "נח",     "דולב",    "אפק",     "אביעד",  "אלנתן",  "יאר",   "אילן",   "דילן",   "סאן",
    "נאור",   "ניצן",   "מבשר",    "אליעד",   "קדם",    "תבור",   "לאון",  "אליאל",  "אלקנה",  "ריין",
    "נורי",   "יונה",   "אלכסנדר", "מתניה",   "מייקל",  "איתיאל", "אלרום", "בצלאל",  "יוחאי",  "יקותיאל",
    "מיאל",   "סול",    "דורון",   "אבינועם", "אוהד",   "חגי",    "יששכר", "שיר",    "ענבר",   "אביגדור",
    "יוגב",   "ניסים",  "שגיא",    "ניר",     "נרי",    "מתנאל",  "אייר",  "מנור",   "לידור",  "אביאור",
    "ישעיהו", "עזריאל", "עמוס",    "תבל",     "חנוך",   "להב",    "צורי",  "נחמיה",  "שמשון",  "כרם",
    "אלי",    "הוד",    "יער",     "אפיק",    "שגב",    "אלישיב", "אמיר"

};

const std::vector<std::string> israelisFemalesFirstNames = {
    "תמר",   "מאיה",   "אביגיל", "נועה",   "שרה",    "איילה",  "אדל",    "יעל",    "שירה",    "אסתר",   "חנה",
    "אלה",   "מרים",   "רחל",    "רבקה",   "ליה",    "חיה",    "טליה",   "רוני",   "רומי",    "מיכל",   "נויה",
    "אריאל", "רות",    "ליבי",   "עלמה",   "הלל",    "אמה",    "גפן",    "גאיה",   "נעמי",    "הודיה",  "עומר",
    "נגה",   "אגם",    "יובל",   "שי-לי",  "אפרת",   "לאה",    "מלכה",   "אורי",   "אוריה",   "יהלי",   "תהילה",
    "אמילי", "יהודית", "תהל",    "ארבל",   "טוהר",   "ליאן",   "הדסה",   "אבישג",  "הילה",    "אלישבע", "אלמה",
    "נעמה",  "עדי",    "שקד",    "עופרי",  "שי",     "מיקה",   "הדס",    "דבורה",  "מעיין",   "לני",    "נטע",
    "נועם",  "הדר",    "הללי",   "מיאל",   "אליה",   "ליב",    "נחמה",   "אור",    "ברכה",    "אופיר",  "אביב",
    "ריף",   "צפורה",  "שיר",    "שחר",    "עמנואל", "חוה",    "ליאל",   "מוריה",  "מיכאלה",  "דניאל",  "ירדן",
    "שושנה", "זוהר",   "אביטל",  "עדן",    "מאי",    "ניב",    "אלי",    "שוהם",   "אלין",    "עמית",   "אביה",
    "גלי",   "בר",     "אן",     "שיה",    "בתיה",   "יולי",   "פיגא",   "הילי",   "רני",     "אנאל",   "שייה",
    "גילי",  "שני",    "יסכה",   "איימי",  "זיו",    "בת שבע", "כרמל",   "סול",    "דריה",    "נאיה",   "אודל",
    "יערה",  "שולמית", "שילת",   "דניאלה", "אמונה",  "ענהאל",  "אמיליה", "ליבא",   "מילה",    "רונה",   "אורין",
    "ארייה", "שיינא",  "טובה",   "רותם",   "גיטל",   "גל",     "יוכבד",  "מאור",   "אוריאן",  "תבל",    "טל",
    "שיראל", "שפרה",   "יעלה",   "פנינה",  "אלכס",   "ליאור",  "משי",    "אליאן",  "יהב",     "איילת",  "רננה",
    "צופיה", "עמליה",  "אורה",   "תאיר",   "מיילי",  "איב",    "לורן",   "לירי",   "זואי",    "אמי",    "ים",
    "יהל",   "סופיה",  "קרני",   "אליענה", "רון",    "בת",     "אלונה",  "בלומה",  "דני",     "לייה",   "אדוה",
    "ניצן",  "לינוי",  "רז",     "רנה",    "הינדא",  "עדינה",  "ענבר",   "לין",    "דור",     "אייר",   "אחינועם",
    "פלג",   "אודיה",  "אריאה",  "עדיה",   "עטרה",   "דינה",   "נלי",    "גילה",   "ארין",    "אמור",   "צביה",
    "כרמי",  "הלני",   "נוי",    "אנה",    "ליאה",   "גוני",   "שיינדל", "לוטם",   "פערל",    "ליאם",   "דורון",
    "גולדה", "כרם",    "פריאל",  "ליהי",   "תפארת",  "כליל",   "אודליה", "נינה",   "אלומה",   "יוטא",   "בארי",
    "רינה",  "תמרה",   "אופק",   "דרור",   "חן",     "לילי",   "אהובה",  "רעות",   "אמלי",    "רייזל",  "תגל",
    "עידן",  "מישל",   "אווה",   "מנור",   "מילי",   "נסיה",   "דוריה",  "בילא",   "גיל",     "סתיו",   "קים",
    "אלמוג", "אדר",    "חושן",   "ספיר",   "אילת",   "סהר",    "יפה",    "אלינור", "מיי",     "שלי",    "תום",
    "מיתר",  "נילי",   "היילי",  "יסמין",  "ירין",   "ריין",   "לירון",  "איטה",   "ליהיא",   "מרגלית", "מייה",
    "גיטי",  "אושר",   "תומר",   "אופל",   "איידל",  "חגית",   "מנוחה",  "ניקול",  "סימה",    "דר",     "נאוה",
    "תהלה",  "מאורי",  "אסנת",   "טויבא",  "רוחמה",  "שירי",   "הניה",   "פריידא", "קדם",     "בל",     "אליאנה",
    "קמה",   "רום",    "פאר",    "לי",     "מטר",    "סימא",   "עליזה",  "ריי",    "אוליביה", "אשירה",  "הענא"};
}
