#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> israelisLastNames = {
    "כהן",       "לוי",     "מזרחי",     "פרץ",     "ביטון",    "דהן",      "אברהם",  "פרידמן",
    "אזולאי",    "מלכה",    "כץ",        "דוד",     "אוחיון",   "חדד",      "עמר",    "גבאי",
    "יוסף",      "בן דוד",  "אדרי",      "קליין",   "חן",       "טל",       "לוין",   "שפירא",
    "חזן",       "מחאמיד",  "זועבי",     "לוין",    "מנשה",     "אוחנה",    "סועאד",  "גולן",
    "סגל",       "אשכנזי",  "יצחק",      "בר",      "יעקב",     "מור",      "שלום",   "אליהו",
    "דיין",      "סויסה",   "לביא",      "אלבז",    "שמש",      "אטיאס",    "בכר",    "נחום",
    "שטרן",      "שרעבי",   "אלון",      "רוזנברג", "ממן",      "בן חמו",   "מימון",  "שחר",
    "וקנין",     "ששון",    "עובדיה",    "אסולין",  "שורץ",     "מאיר",     "וייס",   "גרינברג",
    "חסן",       "אמסלם",   "גולדשטיין", "ברוך",    "טאהא",     "עזרא",     "יפרח",   "פלדמן",
    "רובין",     "הראל",    "סלאמה",     "סבג",     "קדוש",     "מנסור",    "עמאש",   "חיים",
    "שחאדה",     "רז",      "קורן",      "גולדברג", "צור",      "חסון",     "אברמוב", "שרון",
    "רבינוביץ",  "סופר",    "חלבי",      "ישראל",   "דדון",     "יצחקי",    "שוורץ",  "ישראלי",
    "דניאל",     "נעים",    "אהרוני",    "לב",      "עיסא",     "רחמים",    "הרוש",   "נאסר",
    "שושן",      "ברק",     "יחזקאל",    "דוידוב",  "יאסין",    "מילר",     "אורן",   "עודה",
    "קפלן",      "סלימאן",  "בנימין",    "נגר",     "חיון",     "גרוס",     "רוזן",   "גל",
    "הרשקוביץ",  "סולומון", "אסרף",      "מלול",    "אבו כף",   "סלע",      "שטרית",  "אבראהים",
    "ברקוביץ",   "יהודה",   "פלד",       "צרפתי",   "הייב",     "בן שושן",  "זידאן",  "זוהר",
    "שלו",       "עלי",     "זיו",       "עמאר",    "גאנם",     "גוטמן",    "אהרון",  "גנאים",
    "מויאל",     "מרעי",    "אבו ליל",   "אלפסי",   "אליאס",    "אדלר",     "פרנקל",  "גאבר",
    "פלג",       "פישר",    "ברגר",      "ראובן",   "מסרי",     "שכטר",     "צדוק",   "ויצמן",
    "הלוי",      "אביטן",   "אהרון",     "לוגסי",   "נסים",     "רוזנפלד",  "מועלם",  "שוויקי",
    "ליפשיץ",    "דרעי",    "עטיה",      "תורגמן",  "עואד",     "שוקרון",   "שקד",    "דגן",
    "שמעוני",    "דיאב",    "רוט",       "ליברמן",  "יעקובוב",  "ליבוביץ",  "סעיד",   "מנחם",
    "בן חיים",   "חורי",    "פולק",      "ברכה",    "עאסלה",    "פוקס",     "חדאד",   "גולדמן",
    "שמואלי",    "שגב",     "אברהמי",    "מוסא",    "תורג'מן",  "פרי",      "הררי",   "אילוז",
    "סרחאן",     "מנשה",    "אוזן",      "מרדכי",   "קוגן",     "יונס",     "צברי",   "עומר",
    "קרן",       "שדה",     "ח'לאילה",   "שאול",    "אביטל",    "שני",      "סלומון", "קאסם",
    "אלימלך",    "שטיין",   "עבדאללה",   "שיטרית",  "דרור",     "מלמד",     "יונה",   "כחלון",
    "חביב",      "טויטו",   "חביבאללה",  "סבן",     "חמו",      "פנחס",     "בן עמי", "סעדי",
    "בוזגלו",    "דנינו",   "פז",        "חמדאן",   "בן סימון", "רוזנטל",   "בן משה", "סעד",
    "גדיר",      "יוסופוב", "בוסקילה",   "בדארנה",  "ארביב",    "אמארה",    "דביר",   "אבו אל היג'א",
    "אביב",      "עליאן",   "שלמה",      "פורת",    "פריד",     "גוטליב",   "חיימוב", "קאופמן",
    "רביבו",     "אשר",     "אבו סאלח",  "מרקוביץ", "אביטבול",  "אברמוביץ", "יעקבי",  "שניידר",
    "אבו רמילה", "אלקיים",  "רגב",       "נחמני",   "זהבי",     "פינטו"

};
}
