#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> russianMalesFirstNames = {
    "Авдей",      "Авксентий",  "Агапит",    "Агафон",    "Акакий",    "Акиндин",     "Александр", "Алексей",
    "Альберт",    "Анатолий",   "Андрей",    "Аникий",    "Аникита",   "Антон",       "Антонин",   "Анфим",
    "Аристарх",   "Аркадий",    "Арсений",   "Артём",     "Артемий",   "Артур",       "Архипп",    "Афанасий",
    "Богдан",     "Борис",      "Вавила",    "Вадим",     "Валентин",  "Валерий",     "Валерьян",  "Варлам",
    "Варсонофий", "Варфоломей", "Василий",   "Венедикт",  "Вениамин",  "Викентий",    "Виктор",    "Виссарион",
    "Виталий",    "Владимир",   "Владислав", "Владлен",   "Влас",      "Всеволод",    "Вячеслав",  "Гавриил",
    "Галактион",  "Геласий",    "Геннадий",  "Георгий",   "Герасим",   "Герман",      "Германн",   "Глеб",
    "Гордей",     "Григорий",   "Данакт",    "Даниил",    "Демид",     "Демьян",      "Денис",     "Дмитрий",
    "Добрыня",    "Донат",      "Дорофей",   "Евгений",   "Евграф",    "Евдоким",     "Евсей",     "Евстафий",
    "Егор",       "Емельян",    "Еремей",    "Ермолай",   "Ерофей",    "Ефим",        "Ефрем",     "Ждан",
    "Зиновий",    "Иакинф",     "Иван",      "Игнатий",   "Игорь",     "Изот",        "Илья",      "Иннокентий",
    "Ираклий",    "Ириней",     "Исаак",     "Исидор",    "Иуда",      "Иулиан",      "Капитон",   "Ким",
    "Кир",        "Кирилл",     "Климент",   "Кондрат",   "Конон",     "Константин",  "Корнилий",  "Кузьма",
    "Куприян",    "Лаврентий",  "Лев",       "Леонид",    "Леонтий",   "Логгин",      "Лука",      "Лукий",
    "Лукьян",     "Магистриан", "Макар",     "Максим",    "Мамонт",    "Марк",        "Мартын",    "Матвей",
    "Мелентий",   "Мина",       "Мирослав",  "Митрофан",  "Михаил",    "Мстислав",    "Назар",     "Нестор",
    "Никандр",    "Никанор",    "Никита",    "Никифор",   "Никодим",   "Николай",     "Никон",     "Олег",
    "Онисим",     "Онуфрий",    "Павел",     "Паисий",    "Панкратий", "Пантелеймон", "Парфений",  "Пафнутий",
    "Пахомий",    "Пётр",       "Платон",    "Поликарп",  "Порфирий",  "Потап",       "Пров",      "Прокопий",
    "Протасий",   "Прохор",     "Разумник",  "Родион",    "Роман",     "Ростислав",   "Руслан",    "Савва",
    "Савелий",    "Самуил",     "Святополк", "Святослав", "Севастьян", "Семён",       "Серафим",   "Сергей",
    "Сила",       "Сильвестр",  "Созон",     "Софрон",    "Спиридон",  "Станислав",   "Степан",    "Тарас",
    "Тимофей",    "Тимур",      "Тит",       "Тихон",     "Трифон",    "Трофим",      "Урбан",     "Фаддей",
    "Фёдор",      "Федосей",    "Федот",     "Феликс",    "Феоктист",  "Филат",       "Филимон",   "Филипп",
    "Фирс",       "Фока",       "Фома",      "Фотий",     "Фрол",      "Харитон",     "Хрисанф",   "Христофор"};

const std::vector<std::string> russianFemalesFirstNames = {
    "Агафья",    "Аглая",     "Агния",     "Агриппина", "Аза",        "Акулина",   "Алевтина",  "Александра",
    "Алина",     "Алиса",     "Алла",      "Анастасия", "Ангелина",   "Анжела",    "Анжелика",  "Анна",
    "Антонина",  "Анфиса",    "Валентина", "Валерия",   "Варвара",    "Василиса",  "Вера",      "Вероника",
    "Виктория",  "Владимира", "Галина",    "Глафира",   "Гликерия",   "Дана",      "Дарья",     "Евгения",
    "Евдокия",   "Евлалия",   "Евлампия",  "Евпраксия", "Евфросиния", "Екатерина", "Елена",     "Елизавета",
    "Епистима",  "Ермиония",  "Жанна",     "Зинаида",   "Злата",      "Зоя",       "Инга",      "Инесса",
    "Инна",      "Иоанна",    "Ираида",    "Ирина",     "Капитолина", "Карина",    "Каролина",  "Кира",
    "Клавдия",   "Ксения",    "Лада",      "Лариса",    "Лидия",      "Лилия",     "Любовь",    "Людмила",
    "Маргарита", "Марина",    "Мария",     "Марфа",     "Матрёна",    "Милана",    "Милица",    "Мирослава",
    "Надежда",   "Наталья",   "Нина",      "Нонна",     "Оксана",     "Октябрина", "Олимпиада", "Ольга",
    "Павлина",   "Пелагея",   "Пинна",     "Полина",    "Прасковья",  "Рада",      "Раиса",     "Регина",
    "Римма",     "Рогнеда",   "Светлана",  "Серафима",  "Снежана",    "София",     "Сусанна",   "Таисия",
    "Тамара",    "Татьяна",   "Улита",     "Ульяна",    "Урсула",     "Фаина",     "Феврония",  "Фёкла",
    "Феодора",   "Целестина", "Элеонора",  "Юлия",      "Яна",        "Ярослава"};
}
