#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::string> persianMalesFirstNames = {
    "آرمان", "بهروز",    "کیان",    "فریدون",  "سپهر",  "میلاد",   "آرشام", "پوریا",   "بهراد",
    "سیاوش", "احسان",    "شایان",   "شهریار",  "آرتین", "امیدوار", "پارسا", "کاوه",    "پیام",
    "آرین",  "مانی",     "نیما",    "فرهاد",   "کسری",  "کیوان",   "رهام",  "فرشاد",   "آرمین",
    "فرزاد", "ساماندار", "امینوار", "امیرعلی", "رضوان", "حسینیان", "ناصر",  "محمدرضا", "صادق",
    "علی",   "عباس",     "حمید",    "جواد",    "محمود", "علیرضا",  "رامبد", "پیمان",   "مهدی",
    "سجاد",  "محمد",     "یوسف",    "محمدعلی", "حسین",  "رحمان",   "رضا",   "کاظم",    "مهران",
    "نادر",  "مهدیار",   "پرهام",   "پیروز",   "میثم",  "احمد",    "مصطفی"};

const std::vector<std::string> persianFemalesFirstNames = {
    "آتنا",  "پریسا",   "نازنین", "شیرین", "الناز", "سارا",  "زهرا",     "ریحانه", "بهار",  "آیدا",   "نیکا",
    "مهسا",  "نگین",    "یاسمن",  "آرزو",  "لاله",  "روژین", "ترانه",    "پرنیا",  "مریم",  "پگاه",   "سلما",
    "ملیسا", "نسترن",   "مینا",   "پرشین", "مهتا",  "لیلا",  "مهرانگیز", "زینب",   "آزیتا", "پرستو",  "رها",
    "شهناز", "سوگند",   "فرانکا", "لیانا", "سمیرا", "فاطمه", "سهراب",    "هلنا",   "دلارا", "پارمیس", "آوا",
    "پانیذ", "آناهیتا", "سحر",    "ناهید", "آتوسا", "بهناز", "راحله",    "شبنم",   "فریبا", "نرگس",   "رها",
    "سهیلا", "شیدا",    "محیا",   "زهره",  "زیبا",  "رقیه",  "مهتاب",    "الهه",   "ریما",  "مهدیس"};


}