<<<<<<< HEAD
#pragma once
=======
﻿#pragma once
>>>>>>> 36de5791406c2238d9c3fae6787ca4e44dc2d55b

#include <string>
#include <vector>

namespace faker
{
<<<<<<< HEAD
const std::vector<std::string> persianMalesFirstNames = {
    "آرمان", "بهروز",    "کیان",    "فریدون",  "سپهر",  "میلاد",   "آرشام", "پوریا",   "بهراد",
    "سیاوش", "احسان",    "شایان",   "شهریار",  "آرتین", "امیدوار", "پارسا", "کاوه",    "پیام",
    "آرین",  "مانی",     "نیما",    "فرهاد",   "کسری",  "کیوان",   "رهام",  "فرشاد",   "آرمین",
    "فرزاد", "ساماندار", "امینوار", "امیرعلی", "رضوان", "حسینیان", "ناصر",  "محمدرضا", "صادق",
    "علی",   "عباس",     "حمید",    "جواد",    "محمود", "علیرضا",  "رامبد", "پیمان",   "مهدی",
    "سجاد",  "محمد",     "یوسف",    "محمدعلی", "حسین",  "رحمان",   "رضا",   "کاظم",    "مهران",
    "نادر",  "مهدیار",   "پرهام",   "پیروز",   "میثم",  "احمد",    "مصطفی"};

const std::vector<std::string> persianFemalesFirstNames = {
    "آتنا",  "پریسا",   "نازنین", "شیرین", "الناز", "سارا",  "زهرا",     "ریحانه", "بهار",  "آیدا",   "نیکا",
    "مهسا",  "نگین",    "یاسمن",  "آرزو",  "لاله",  "روژین", "ترانه",    "پرنیا",  "مریم",  "پگاه",   "سلما",
    "ملیسا", "نسترن",   "مینا",   "پرشین", "مهتا",  "لیلا",  "مهرانگیز", "زینب",   "آزیتا", "پرستو",  "رها",
    "شهناز", "سوگند",   "فرانکا", "لیانا", "سمیرا", "فاطمه", "سهراب",    "هلنا",   "دلارا", "پارمیس", "آوا",
    "پانیذ", "آناهیتا", "سحر",    "ناهید", "آتوسا", "بهناز", "راحله",    "شبنم",   "فریبا", "نرگس",   "رها",
    "سهیلا", "شیدا",    "محیا",   "زهره",  "زیبا",  "رقیه",  "مهتاب",    "الهه",   "ریما",  "مهدیس"};
=======
const std::vector<std::wstring> persianMalesFirstNames = {
    L"آرمان", L"بهروز",    L"کیان",    L"فریدون",  L"سپهر",  L"میلاد",   L"آرشام", L"پوریا",   L"بهراد",
    L"سیاوش", L"احسان",    L"شایان",   L"شهریار",  L"آرتین", L"امیدوار", L"پارسا", L"کاوه",    L"پیام",
    L"آرین",  L"مانی",     L"نیما",    L"فرهاد",   L"کسری",  L"کیوان",   L"رهام",  L"فرشاد",   L"آرمین",
    L"فرزاد", L"ساماندار", L"امینوار", L"امیرعلی", L"رضوان", L"حسینیان", L"ناصر",  L"محمدرضا", L"صادق",
    L"علی",   L"عباس",     L"حمید",    L"جواد",    L"محمود", L"علیرضا",  L"رامبد", L"پیمان",   L"مهدی",
    L"سجاد",  L"محمد",     L"یوسف",    L"محمدعلی", L"حسین",  L"رحمان",   L"رضا",   L"کاظم",    L"مهران",
    L"نادر",  L"مهدیار",   L"پرهام",   L"پیروز",   L"میثم",  L"احمد",    L"مصطفی"};

const std::vector<std::wstring> persianFemalesFirstNames = {
    L"آتنا",  L"پریسا",   L"نازنین", L"شیرین", L"الناز", L"سارا",  L"زهرا",     L"ریحانه", L"بهار",  L"آیدا",   L"نیکا",
    L"مهسا",  L"نگین",    L"یاسمن",  L"آرزو",  L"لاله",  L"روژین", L"ترانه",    L"پرنیا",  L"مریم",  L"پگاه",   L"سلما",
    L"ملیسا", L"نسترن",   L"مینا",   L"پرشین", L"مهتا",  L"لیلا",  L"مهرانگیز", L"زینب",   L"آزیتا", L"پرستو",  L"رها",
    L"شهناز", L"سوگند",   L"فرانکا", L"لیانا", L"سمیرا", L"فاطمه", L"سهراب",    L"هلنا",   L"دلارا", L"پارمیس", L"آوا",
    L"پانیذ", L"آناهیتا", L"سحر",    L"ناهید", L"آتوسا", L"بهناز", L"راحله",    L"شبنم",   L"فریبا", L"نرگس",   L"رها",
    L"سهیلا", L"شیدا",    L"محیا",   L"زهره",  L"زیبا",  L"رقیه",  L"مهتاب",    L"الهه",   L"ریما",  L"مهدیس"};
>>>>>>> 36de5791406c2238d9c3fae6787ca4e44dc2d55b


}