#pragma once

#include <string>
#include <vector>

namespace faker
{
const std::vector<std::wstring> persianMalesFirstNames = {
    L"آرمان", L"بهروز",    L"کیان",    L"فریدون",  L"سپهر",  L"میلاد",   L"آرشام", L"پوریا",   L"بهراد",
    L"سیاوش", L"احسان",    L"شایان",   L"شهریار",  L"آرتین", L"امیدوار", L"پارسا", L"کاوه",    L"پیام",
    L"آرین",  L"مانی",     L"نیما",    L"فرهاد",   L"کسری",  L"کیوان",   L"رهام",  L"فرشاد",   L"آرمین",
    L"فرزاد", L"ساماندار", L"امینوار", L"امیرعلی", L"رضوان", L"حسینیان", L"ناصر",  L"محمدرضا", L"صادق",
    L"علی",   L"عباس",     L"حمید",    L"جواد",    L"محمود", L"علیرضا",  L"رامبد", L"پیمان",   L"مهدی",
    L"سجاد",  L"محمد",     L"یوسف",    L"محمدعلی", L"حسین",  L"رحمان",   L"رضا",   L"کاظم",    L"مهران",
    L"نادر",  L"مهدیار",   L"پرهام",   L"پیروز",   L"میثم",  L"احمد",    L"مصطفی"};

const std::vector<std::wstring> persianFemalesFirstNames = {
    L"آتنا",  L"پریسا",   L"نازنین", L"شیرین", L"الناز", L"سارا",  L"زهرا",     L"ریحانه", L"بهار",  L"آیدا",   L"نیکا",
    L"مهسا",  L"نگین",    L"یاسمن",  L"آرزو",  L"لاله",  L"روژین", L"ترانه",    L"پرنیا",  L"مریم",  L"پگاه",   L"سلما",
    L"ملیسا", L"نسترن",   L"مینا",   L"پرشین", L"مهتا",  L"لیلا",  L"مهرانگیز", L"زینب",   L"آزیتا", L"پرستو",  L"رها",
    L"شهناز", L"سوگند",   L"فرانکا", L"لیانا", L"سمیرا", L"فاطمه", L"سهراب",    L"هلنا",   L"دلارا", L"پارمیس", L"آوا",
    L"پانیذ", L"آناهیتا", L"سحر",    L"ناهید", L"آتوسا", L"بهناز", L"راحله",    L"شبنم",   L"فریبا", L"نرگس",   L"رها",
    L"سهیلا", L"شیدا",    L"محیا",   L"زهره",  L"زیبا",  L"رقیه",  L"مهتاب",    L"الهه",   L"ریما",  L"مهدیس"};


}